{
  "date": "2026-02-24",
  "report_path": "daily-data/2026/02/24/report.html",
  "digest": {
    "key_news_summary": "Indonesia has taken a significant role in the Gaza peacekeeping mission, deploying thousands of troops as part of the US-led International Stabilisation Force [6]. The US Army is accelerating the development of a 1000 km anti-ship Precision Strike Missile, enhancing its long-range strike capabilities [39]. LOCKHEED MARTIN (LMT) has tested AI on the F-35 for autonomous identification of unknown contacts, advancing AI integration in military aircraft [24]. NORTHROP GRUMMAN (NOC) is expediting B-21 Raider production with a $4.5 billion funding boost, aiming for delivery by 2027 [20;23;25]. Kratos and GE Aerospace have secured a $12.4 million contract to design an engine for the US Air Force's Collaborative Combat Aircraft, focusing on affordability and performance [16]. KRATOS DEFENSE (KTOS) reported strong financial results and secured multiple new defense contracts, boosting investor confidence [17].\n\nToday's defense market showed a mixed tone, with some stocks rising on contract wins and technological advancements, while others fell amid broader macro defense spending concerns. Notably, Kratos gained attention with a new US Air Force contract, while European defense spending continues to bolster certain stocks [999].",
    "key_stocks_summary": "Today's defense market showed a mixed tone, with some stocks rising on contract wins and technological advancements, while others fell amid broader macro defense spending concerns. Notably, Kratos gained attention with a new US Air Force contract, while European defense spending continues to bolster certain stocks [999].",
    "disclaimer": "General information only — not financial advice."
  },
  "stocks": {
    "table_rows": [
      {
        "Ticker": "PLTR",
        "Today Price/Δ": "$130.60 (▼ -4.64, -3.43%)",
        "Fresh catalyst(s) [n] (direct / adjacent / macro)": "No direct catalysts; macro defense spending context [3]",
        "TA snapshot": "D/W/M: Up/Flat/Down; <20/50; near S1 128",
        "Signal": "Cautious; macro pressures"
      },
      {
        "Ticker": "AVAV",
        "Today Price/Δ": "$261.33 (▼ -3.30, -1.25%)",
        "Fresh catalyst(s) [n] (direct / adjacent / macro)": "No direct catalysts; macro defense spending context [3]",
        "TA snapshot": "D/W/M: Up/Up/Flat; >20/50; testing R1 265",
        "Signal": "Cautious; sector-wide spending"
      },
      {
        "Ticker": "APH",
        "Today Price/Δ": "$147.82 (▼ -3.22, -2.13%)",
        "Fresh catalyst(s) [n] (direct / adjacent / macro)": "No direct catalysts; macro defense spending context [3]",
        "TA snapshot": "D/W/M: Flat/Flat/Down; <20/50; near S1 145",
        "Signal": "Bearish; weak technicals"
      },
      {
        "Ticker": "KTOS",
        "Today Price/Δ": "$94.31 (▼ -1.77, -1.84%)",
        "Fresh catalyst(s) [n] (direct / adjacent / macro)": "US Air Force contract for engine design [16]",
        "TA snapshot": "D/W/M: Up/Up/Up; >20/50; testing R1 96",
        "Signal": "Bullish; new contract win"
      },
      {
        "Ticker": "EPIRUS",
        "Today Price/Δ": "Not publicly listed (no market data)",
        "Fresh catalyst(s) [n] (direct / adjacent / macro)": "Partnership with Digital Force Technologies [12]",
        "TA snapshot": "N/A",
        "Signal": "N/A"
      },
      {
        "Ticker": "RHM.DE",
        "Today Price/Δ": "$1,718.00 (▲ +16.50, +0.97%)",
        "Fresh catalyst(s) [n] (direct / adjacent / macro)": "No direct catalysts; macro European defense spending [3]",
        "TA snapshot": "D/W/M: Up/Up/Up; >20/50; testing R1 1720",
        "Signal": "Bullish; strong European demand"
      },
      {
        "Ticker": "ITA",
        "Today Price/Δ": "$241.26 (▼ -2.39, -0.98%)",
        "Fresh catalyst(s) [n] (direct / adjacent / macro)": "No direct catalysts; macro defense spending context [3]",
        "TA snapshot": "D/W/M: Up/Flat/Up; >20/50; near S1 240",
        "Signal": "Cautious; sector-wide trends"
      },
      {
        "Ticker": "LMT",
        "Today Price/Δ": "$660.62 (▲ +2.36, +0.36%)",
        "Fresh catalyst(s) [n] (direct / adjacent / macro)": "AI in F-35 testing [24]",
        "TA snapshot": "D/W/M: Up/Up/Up; >20/50; testing R1 665",
        "Signal": "Bullish; AI integration progress"
      },
      {
        "Ticker": "NOC",
        "Today Price/Δ": "$725.39 (▲ +1.83, +0.25%)",
        "Fresh catalyst(s) [n] (direct / adjacent / macro)": "Accelerating B-21 Raider production [20]",
        "TA snapshot": "D/W/M: Up/Up/Up; >20/50; testing R1 730",
        "Signal": "Bullish; production boost"
      },
      {
        "Ticker": "RTX",
        "Today Price/Δ": "$201.92 (▼ -3.00, -1.46%)",
        "Fresh catalyst(s) [n] (direct / adjacent / macro)": "Defense and autonomy wins [46]",
        "TA snapshot": "D/W/M: Up/Flat/Up; >20/50; near S1 200",
        "Signal": "Cautious; mixed signals"
      },
      {
        "Ticker": "BA",
        "Today Price/Δ": "$230.44 (▼ -1.59, -0.69%)",
        "Fresh catalyst(s) [n] (direct / adjacent / macro)": "Demonstrates AI for space-grade hardware [18]",
        "TA snapshot": "D/W/M: Up/Flat/Up; >20/50; testing R1 235",
        "Signal": "Cautious; innovation in AI"
      },
      {
        "Ticker": "GD",
        "Today Price/Δ": "$348.98 (▼ -2.44, -0.69%)",
        "Fresh catalyst(s) [n] (direct / adjacent / macro)": "No direct catalysts; macro defense spending context [3]",
        "TA snapshot": "D/W/M: Flat/Up/Up; >20/50; near S1 345",
        "Signal": "Cautious; sector-wide trends"
      },
      {
        "Ticker": "HII",
        "Today Price/Δ": "$438.01 (▲ +0.44, +0.10%)",
        "Fresh catalyst(s) [n] (direct / adjacent / macro)": "No direct catalysts; macro defense spending context [3]",
        "TA snapshot": "D/W/M: Up/Up/Flat; >20/50; testing R1 440",
        "Signal": "Cautious; stable outlook"
      }
    ]
  },
  "news": {
    "items": [
      {
        "ref": 1,
        "title": "Philippine Navy commissions new patrol vessel, missile boat",
        "url": "https://www.navalnews.com/naval-news/2026/02/philippine-navy-commissions-new-patrol-vessel-missile-boat/",
        "source": "navalnews.com",
        "published": "2026-02-24T11:22:10+00:00",
        "summary": "Two of the Philippine Navy’s newest ships entered active duty during a commissioning ceremony at the Naval Operating Base in Subic Bay on Tuesday. The offshore patrol vessel BRP Rajah Sulayman (PS-20) was inducted into service alongside the fast attack interdiction craft BRP Audrey Bañares (PG-910). The BRP Rajah Sulayman , named after a pre-Hispanic ruler who led Tagalog forces during the 1570 Battle of Manila, is the first of six 2,400-ton ships under a ₱30 billion ($573 million) contract signed with South Korean shipbuilder HD Hyundai in 2022. Its commissioning follows post-delivery activit…",
        "topics": []
      },
      {
        "ref": 2,
        "title": "Flytbase launches connectivity platform and AI agents",
        "url": "https://www.unmannedairspace.info/uncategorized/flytbase-launches-connectivity-platform-and-ai-agents/",
        "source": "unmannedairspace.info",
        "published": "2026-02-24T11:19:26+00:00",
        "summary": "FlytBase has introduced FlytBase One, building a foundational platform for the Physical AI era, where autonomous drones, robots, sensors and enterprise infrastructure operate as connected systems instead of isolated tools. The company has also announced Verkos AI agents, designed to detect events in live video, trigger actions and deliver alerts and notifications across fleets of autonomous devices. “Cameras, drones, radar, robots, vehicles and field operations still run on disconnected platforms,” the company said. “The result is a visibility and action gap: enterprises can see events in frag…",
        "topics": []
      },
      {
        "ref": 3,
        "title": "Europe re-arms as US slows defence spending",
        "url": "https://www.ft.com/content/9593e226-25de-4108-b604-8c413675cd75",
        "source": "ft.com",
        "published": "2026-02-24T11:00:08+00:00",
        "summary": "Washington remains world’s largest military power but European capitals spend more than before, says IISS",
        "topics": []
      },
      {
        "ref": 4,
        "title": "“Aerlijn’s Nightmare V3 high speed C-UAS interceptor now available in Europe” - Unmanned airspace",
        "url": "https://news.google.com/rss/articles/CBMi2gFBVV95cUxQc2RNTlp6TDdwbHdfVDRXQ3RTS1N1eTBwcVl1QTRYS0RxRnN1eTI3RXRxNXlQWTUzYnBqRHZ4dFpjY3dEdW80Zm9fWUh4UUFYaHNSMTNUOWpWYlF0RHZrWENiZ0xzQ2ZYc3NFOWl5dU1YTV9fejFTSmpJUzJ5MTk0TnpURlo2MUVXZzQ4X1EtLVJLY2hVS3NiLV9CYjItSGNtS3pWZnJVeXF6VHpkTkNBS3lzRG42TzRfdm9QV0J6alhkMUpCWWNMVmZSV0U0NE9MRG5CMGZfeHNuQQ?oc=5",
        "source": "news.google.com",
        "published": "2026-02-24T10:55:21+00:00",
        "summary": "“Aerlijn’s Nightmare V3 high speed C-UAS interceptor now available in Europe” Unmanned airspace",
        "topics": []
      },
      {
        "ref": 5,
        "title": "&#8220;Aerlijn&#8217;s Nightmare V3 high speed C-UAS interceptor now available in Europe&#8221;",
        "url": "https://www.unmannedairspace.info/counter-uas-systems-and-policies/aerlijns-nightmare-v3-high-speed-c-uas-interceptor-now-available-in-europe/",
        "source": "unmannedairspace.info",
        "published": "2026-02-24T10:52:33+00:00",
        "summary": "Ukraine’s Defence Tech Community in a Linkedin story reports that Dutch company Aerlijn has introduced its Nightmare V3 high-speed interceptor to the European market, developed in collaboration with Ukrainian Project ODIN. “Designed to neutralise Class-1 strike drones, Nightmare V3 reaches speeds of 280–300 km/h and features a thermal LWIR camera, automatic target acquisition up to 800 m, a 10 km tactical range, and an operational ceiling above 6 km,” said the report. “The Dutch company has successfully intercepted Shahed, Gerbera, and Lancet drones. The system has been used and recommended by…",
        "topics": []
      },
      {
        "ref": 6,
        "title": "Why Indonesia’s lead role in Gaza peacekeeping force carries high political risk",
        "url": "https://www.scmp.com/week-asia/politics/article/3344477/why-indonesias-lead-role-gaza-peacekeeping-force-carries-high-political-risk?utm_source=rss_feed",
        "source": "scmp.com",
        "published": "2026-02-24T10:31:59+00:00",
        "summary": "Indonesia’s decision to accept a deputy commander post in the United States-led International Stabilisation Force (ISF) for Gaza has placed it in a position to play a prominent role in the mission as it prepares to deploy thousands of troops to the war-torn enclave. While the Indonesian government has stressed that its personnel would focus on protecting civilians and supporting humanitarian efforts, analysts say the ISF’s broader objectives – including the disarmament of Palestinian armed...",
        "topics": []
      },
      {
        "ref": 7,
        "title": "‘Record’ Chinese maritime militia deployed in South China Sea in 2025: US report",
        "url": "https://www.scmp.com/news/china/military/article/3344474/record-chinese-maritime-militia-deployed-south-china-sea-2025-us-report?utm_source=rss_feed",
        "source": "scmp.com",
        "published": "2026-02-24T10:18:23+00:00",
        "summary": "China’s maritime militia was deployed in “record-high numbers” across the disputed South China Sea in 2025, according to a US think tank report. However, the report also cited a concentration of civilian fishing fleets near less contested reefs, saying this suggested their waning strategic role for Beijing. The report was published on Monday by the Asia Maritime Transparency Initiative (AMTI) – a research programme affiliated with the Centre for Strategic and International Studies, a...",
        "topics": []
      },
      {
        "ref": 8,
        "title": "NATO Commemorates the Fourth Anniversary of Russia’s Full-Scale Invasion of Ukraine - North Atlantic Treaty Organization",
        "url": "https://news.google.com/rss/articles/CBMi4AFBVV95cUxPdTdVY2F3ZW5TaW1hZzlvYnpvWVRxeWRZNEgzbUxHTU9CaFlnOTBZTkRqdFVlTW1NczIyUkNkNEY4Nlc2M3I1R0tXVURnS3ZGWTBHenhMY0d0RHZwZEhPT3ItNzJ0LTQxSlRuWWZrTThNNFo4a19kNC0tY1MxT2o5SUtfRTdlNHh4NU9HMkJUTkRaMzF2M1I1REVVNjJsY2FCcTR6S3NVa1Y2UmFoWVVEYkhPdFlYcU1JVlNOU3kzd3RXd2lVX2Z1Ukh2UjVGYXlfSm44SmZaTjBqOTdiclAtUQ?oc=5",
        "source": "news.google.com",
        "published": "2026-02-24T10:08:15+00:00",
        "summary": "NATO Commemorates the Fourth Anniversary of Russia’s Full-Scale Invasion of Ukraine North Atlantic Treaty Organization",
        "topics": []
      },
      {
        "ref": 9,
        "title": "One hull for today’s crews and tomorrow’s unmanned missions: Cross Water positions modular aluminium RIB as a transition platform",
        "url": "https://www.navalnews.com/naval-news/2026/02/one-hull-for-todays-crews-and-tomorrows-unmanned-missions-cross-water-positions-modular-aluminium-rib-as-a-transition-platform/",
        "source": "navalnews.com",
        "published": "2026-02-24T09:29:00+00:00",
        "summary": "Maritime forces are being asked to modernise in two directions at once. They must keep crewed boats reliable, safe and ready for daily missions while also preparing for unmanned and autonomous concepts that are advancing quickly but unevenly across regulations, training, maintenance culture and operational trust. Sponsored by Cross Water Production, a Swedish–Estonian boatbuilder, is positioning its Cross Water Modular aluminium RIB around a simple premise: many operators do not want two separate fleets – one “traditional” and one “unmanned.” Instead, the company proposes a long-life base hull…",
        "topics": []
      },
      {
        "ref": 10,
        "title": "Finnish Defence Forces to procure Parrot ANAFI UKR micro-UAV systems to strengthen ISR capabilities",
        "url": "https://www.suasnews.com/2026/02/finnish-defence-forces-to-procure-parrot-anafi-ukr-micro-uav-systems-to-strengthen-isr-capabilities/",
        "source": "suasnews.com",
        "published": "2026-02-24T09:22:05+00:00",
        "summary": "Parrot, a European leader in professional micro-UAVs, welcomes the announcement made by the Finnish Defence",
        "topics": []
      },
      {
        "ref": 11,
        "title": "Mehler develops close-range C-UAS for land vehicles",
        "url": "https://www.unmannedairspace.info/counter-uas-systems-and-policies/mehler-develops-close-range-c-uas-for-land-vehicles/",
        "source": "unmannedairspace.info",
        "published": "2026-02-24T09:19:08+00:00",
        "summary": "Mehler Protection has developed a new close-range protection system to counter drones attacking land vehicles from short range and low angles. The SCILT system has been conceived as a last protective layer for individual vehicles, addressing the gap between large-scale mobile air defence systems and passive vehicle protection. Designed to counter small drones, including FPV drones, kamikaze drones and loitering munitions, SCILT operates in close and very close-range engagements and is intended to defeat both single drones and multiple simultaneous threats in the immediate hazard zone. The syst…",
        "topics": []
      },
      {
        "ref": 12,
        "title": "Epirus teams up with Digital Force Technologies to develop non-kinetic C-UAS",
        "url": "https://www.unmannedairspace.info/counter-uas-systems-and-policies/epirus-teams-up-with-digital-force-technologies-to-develop-non-kinetic-c-uas/",
        "source": "unmannedairspace.info",
        "published": "2026-02-24T08:54:42+00:00",
        "summary": "Epirus and Digital Force Technologies (DFT) have formed a partnership to deliver a fully integrated counter-uncrewed aerial system (C-UAS) kill chain that combines the companies’ respective technologies for detection, tracking, identification, localisation and non-kinetic, low-collateral defeat. Under the agreement, Epirus will lead systems integration of DFT’s Seraphim command-and-control and multi-modal sensor fusion software with Epirus’ Leonidas high-power microwave (HPM) platform. Leonidas uses electromagnetic interference to defeat swarming, AI-controlled and fibre-optic guided UAS that …",
        "topics": []
      },
      {
        "ref": 13,
        "title": "Australia announces acquisition of long-lead items for AUKUS nuclear propulsion systems",
        "url": "https://www.navalnews.com/naval-news/2026/02/australia-announces-acquisition-of-long-lead-items-for-aukus-nuclear-propulsion-systems/",
        "source": "navalnews.com",
        "published": "2026-02-24T08:33:24+00:00",
        "summary": "The Australian (Prime Minister Albanese) Government has announced a $310 million payment for the acquisition of long‑lead items from the United Kingdom to support Australia’s future sovereign conventionally‑armed, nuclear‑powered submarine capability (SSN-AUKUS ) . Australian Ministry of Defense press release Today’s announcement will directly support the manufacture of critical components for nuclear‑powered submarines which will be built at Osborne in South Australia, including the nuclear propulsion systems of Australia’s first two SSN-AUKUS. Under the AUKUS program, the United Kingdom will…",
        "topics": []
      },
      {
        "ref": 14,
        "title": "Schiebel to Establish a UK Entity to Support Expanding Defence Opportunities",
        "url": "https://www.uasvision.com/2026/02/24/schiebel-to-establish-a-uk-entity-to-support-expanding-defence-opportunities/",
        "source": "uasvision.com",
        "published": "2026-02-24T06:54:59+00:00",
        "summary": "Schiebel announces its intention to establish a dedicated Schiebel UK legal entity, reflecting strong growth opportunities in the United Kingdom defence market and the company’s long-term commitment to supporting the UK Armed Forces and industrial partners. The decision follows the successful collaboration with Thales UK to deliver the Peregrine Rotary Wing Unmanned Aerial System (RWUAS), based […]",
        "topics": []
      },
      {
        "ref": 15,
        "title": "Northrop Grumman Proposes Cannon-Based Air Defence System for US Army Drone Threat",
        "url": "https://www.uasvision.com/2026/02/24/northrop-grumman-proposes-cannon-based-air-defence-system-for-us-army-drone-threat/",
        "source": "uasvision.com",
        "published": "2026-02-24T06:50:42+00:00",
        "summary": "Northrop Grumman is advancing its Cannon-Based Air Defense (CBAD) concept as a scalable response to the growing threat of drone swarms and low-flying cruise missiles targeting U.S. Army formations. CBAD integrates guided medium-caliber cannon ammunition with layered radar and electro-optical sensors, all connected through battle management command-and-control networks. Rather than functioning as a standalone gun […]",
        "topics": []
      },
      {
        "ref": 16,
        "title": "Kratos and GE Aerospace Win US Air Force Award to Design Engine for Expendable Collaborative Combat Aircraft",
        "url": "https://www.uasvision.com/2026/02/24/kratos-and-ge-aerospace-win-us-air-force-award-to-design-engine-for-expendable-collaborative-combat-aircraft/",
        "source": "uasvision.com",
        "published": "2026-02-24T06:30:02+00:00",
        "summary": "Kratos Defense & Security Solutions, Inc. has announced a joint U.S. Air Force contract worth $12.4 million to design a next-generation engine for small Collaborative Combat Aircraft (CCA). The initial phase will complete the preliminary design of the GEK1500, targeting demanding performance requirements while meeting aggressive cost goals to enable affordable mass production. Stacey Rock, […]",
        "topics": []
      },
      {
        "ref": 17,
        "title": "A Look At Kratos Defense & Security Solutions (KTOS) Valuation After Strong Results And Major Defense Contract Wins",
        "url": "https://finance.yahoo.com/news/look-kratos-defense-security-solutions-021442082.html?.tsrc=rss",
        "source": "finance.yahoo.com",
        "published": "2026-02-24T02:14:42+00:00",
        "summary": "Kratos Defense & Security Solutions (KTOS) has investors’ attention after reporting fourth quarter and full year 2025 results, with higher revenue and net income than a year earlier, alongside multiple new defense contract wins. See our latest analysis for Kratos Defense & Security Solutions. Kratos’ recent earnings beat and steady flow of new defense and space contracts have come after a sharp re-rating. The stock has shown a 25.66% 3 month share price return and a very large 1 year total...",
        "topics": []
      },
      {
        "ref": 18,
        "title": "Boeing demonstrates large language model for space-grade hardware",
        "url": "https://spacenews.com/boeing-demonstrates-large-language-model-for-space-grade-hardware/",
        "source": "spacenews.com",
        "published": "2026-02-24T01:47:12+00:00",
        "summary": "SAN FRANCISCO – Before uploading a large language model to space-grade hardware, Boeing Space Mission Systems engineers sought guidance from the hardware manufacturer. “They told us it wasn’t possible, but we are skilled engineers who were going to figure out a pathway to make it happen,” Arvel Chappell III, Boeing Space Mission Systems AI Lab […] The post Boeing demonstrates large language model for space-grade hardware appeared first on SpaceNews .",
        "topics": []
      },
      {
        "ref": 19,
        "title": "Collaborative Combat Aircraft program progresses through deliberate weapons integration testing",
        "url": "https://www.af.mil/News/Article-Display/Article/4412705/collaborative-combat-aircraft-program-progresses-through-deliberate-weapons-int/",
        "source": "af.mil",
        "published": "2026-02-24T01:11:00+00:00",
        "summary": "The Air Force has entered the next phase of developmental testing for its Collaborative Combat Aircraft program.",
        "topics": []
      },
      {
        "ref": 20,
        "title": "Northrop Grumman Accelerating B-21 Raider Production - Northrop Grumman",
        "url": "https://news.google.com/rss/articles/CBMilAFBVV95cUxOMm5sNDFBLXRYQ2J4MTJFVkszOU5COEY2RG5EVjc3SkZBWlZ4RVc0VzM3RnRDLWd2ZUEwbGpKX1VYMDBJemZiWm43RVYtVXpiVjlTaTdmRU82UE5rRzJ0ZGk3aGRCUEdBVDNPWVExdTJlSkU0em8xNmZHSTUtVG5Fams2MDlMVWU1dDZ6SEp1VGxSVFNB?oc=5",
        "source": "news.google.com",
        "published": "2026-02-24T01:02:08+00:00",
        "summary": "Northrop Grumman Accelerating B-21 Raider Production Northrop Grumman",
        "topics": []
      },
      {
        "ref": 21,
        "title": "Meink, Saltzman make case for Space Force expansion",
        "url": "https://spacenews.com/meink-saltzman-make-case-for-space-force-expansion/",
        "source": "spacenews.com",
        "published": "2026-02-24T00:42:02+00:00",
        "summary": "Meink: How the future force is designed ‘will be critical as the Space Force expands even faster in the next few years’ The post Meink, Saltzman make case for Space Force expansion appeared first on SpaceNews .",
        "topics": []
      },
      {
        "ref": 22,
        "title": "US Urgently Needs New M1-E3 Tank to Replace Drone Vulnerable M1 Abrams Tank",
        "url": "https://www.nextbigfuture.com/2026/02/us-urgently-needs-new-m1-e3-tank-to-replace-drone-vulnerable-m1-abrams-tank.html",
        "source": "nextbigfuture.com",
        "published": "2026-02-24T00:18:58+00:00",
        "summary": "The US Army is now a rushing to make the new M1-E3 tank because 27 out of 31 M1 Abrams were wrecked in Ukraine. They were mainly destroyed by cheap drones and mines. The new tank will have be lighter and have improved defences against cheap drones. Better armor in the right spots and better ... Read more",
        "topics": []
      },
      {
        "ref": 23,
        "title": "Air Force ramps up B-21 Raider production capacity, aims for 2027 delivery",
        "url": "https://breakingdefense.com/2026/02/air-force-ramps-up-b-21-raider-production-capacity-aims-for-2027-delivery/",
        "source": "breakingdefense.com",
        "published": "2026-02-23T23:30:06+00:00",
        "summary": "A $4.5 billion spending boost for the B-21 program outlined by lawmakers as part of the 2025 reconciliation package will help fund the accelerated production.",
        "topics": []
      },
      {
        "ref": 24,
        "title": "Lockheed test-flies F-35 with artificial intelligence to quickly ID unknown contacts",
        "url": "https://breakingdefense.com/2026/02/lockheed-test-flies-f-35-with-artificial-intelligence-to-quickly-id-unknown-contacts/",
        "source": "breakingdefense.com",
        "published": "2026-02-23T22:33:22+00:00",
        "summary": "Known as Project Overwatch, the AI is trained to distinguish different types of emissions, autonomously identifying the source for the human pilot.",
        "topics": []
      },
      {
        "ref": 25,
        "title": "DAF increases B-21 Raider production capacity to deliver combat capability faster",
        "url": "https://www.af.mil/News/Article-Display/Article/4412198/daf-increases-b-21-raider-production-capacity-to-deliver-combat-capability-fast/",
        "source": "af.mil",
        "published": "2026-02-23T22:18:00+00:00",
        "summary": "The Department of the Air Force and Northrop Grumman Corp. have reached an agreement to expand production capacity for the B-21 Raider, accelerating delivery of the Air Force’s next-generation stealth bomber fleet.",
        "topics": []
      },
      {
        "ref": 26,
        "title": "Contracts for Feb. 23, 2026",
        "url": "https://www.war.gov/News/Contracts/Contract/Article/4412484/contracts-for-feb-23-2026/",
        "source": "war.gov",
        "published": "2026-02-23T22:00:43+00:00",
        "summary": "Today's Department of War contracts valued at $7.5 million or more are now live on War.gov.",
        "topics": []
      },
      {
        "ref": 27,
        "title": "SDA taps AST SpaceMobile to demo commercial satellite links to military radios",
        "url": "https://breakingdefense.com/2026/02/sda-taps-ast-spacemobile-to-demo-commercial-satellite-links-to-military-radios/",
        "source": "breakingdefense.com",
        "published": "2026-02-23T21:46:32+00:00",
        "summary": "The $30M award is the first under SDA’s Hybrid Acquisition for proliferated Low-earth Orbit (HALO) program.",
        "topics": []
      },
      {
        "ref": 28,
        "title": "IonQ Selected to Support Missile Defense Agency SHIELD IDIQ Contract",
        "url": "http://www.businesswire.com/news/home/20260223400381/en/IonQ-Selected-to-Support-Missile-Defense-Agency-SHIELD-IDIQ-Contract/?feedref=JjAwJuNHiystnCoBq_hl-d9cWptq3LFKqvWRRM6VXqVcgiwDl5F89IquLVWUqfRVgLxDkSKfgoruKb9yWl5as-PbWreMWuYBefATrZ0EPTXUYDHrCfzvcc7PfEC8QrAfBSvR87oUDgbHejiywQBpbg==",
        "source": "businesswire.com",
        "published": "2026-02-23T21:30:00+00:00",
        "summary": "COLLEGE PARK, Md.--(BUSINESS WIRE)--IonQ (NYSE: IONQ) is pleased to announce it was awarded a contract under the Missile Defense Agency Scalable Homeland Innovative Enterprise Layered Defense (SHIELD) indefinite-delivery/indefinite-quantity (IDIQ) contract with a ceiling of $151 billion. This contract encompasses a broad range of work areas that allows for the rapid delivery of innovative capabilities to the warfighter with increased speed and agility. IonQ is among more than 2,400 companies el",
        "topics": []
      },
      {
        "ref": 29,
        "title": "US pulls nonessential staff from Beirut embassy as tensions with Iran ratchet up",
        "url": "https://www.armytimes.com/news/pentagon-congress/2026/02/23/us-pulls-nonessential-staff-from-beirut-embassy-as-tensions-with-iran-ratchet-up/",
        "source": "armytimes.com",
        "published": "2026-02-23T21:20:08+00:00",
        "summary": "The United States has ordered nonessential personnel and their family members to leave its embassy in Beirut, a senior State Department official told Military Times on Monday, as Washington continues a massive military buildup in the Middle East. The official, who spoke on the condition of anonymity to discuss sensitive information, said the drawdown is a “prudent” step to reduce the American footprint in the region while President Donald Trump mulls a strike on Iran. “The Embassy remains operational with core staff in place. This is a temporary measure intended to ensure the safety of our per…",
        "topics": []
      },
      {
        "ref": 30,
        "title": "Reconciliation revealed: How the Pentagon plans to spend all $152 billion in FY26",
        "url": "https://breakingdefense.com/2026/02/reconciliation-revealed-how-the-pentagon-plans-to-spend-all-152-billion-in-fy26/",
        "source": "breakingdefense.com",
        "published": "2026-02-23T20:28:50+00:00",
        "summary": "The spending plan, obtained by Breaking Defense, pumps billions into munitions, missile defense and shipbuilding, among other priorities.",
        "topics": []
      },
      {
        "ref": 31,
        "title": "F-22 Raptor, MQ-20 drone complete manned-unmanned flight exercise",
        "url": "https://www.defensenews.com/industry/techwatch/2026/02/23/f-22-raptor-mq-20-drone-complete-manned-unmanned-flight-exercise/",
        "source": "defensenews.com",
        "published": "2026-02-23T19:35:55+00:00",
        "summary": "The U.S. Air Force and General Atomics Aeronautical Systems Inc. recently completed a successful manned-unmanned teamed demonstration between an F-22 Raptor and an MQ-20 Avenger unmanned aircraft, advancing the integration of autonomous systems into tactical fighter operations, according to a Feb. 23 company release . The live-flight exercise, conducted at Edwards Air Force Base in California, featured a human-piloted F-22 issuing real-time commands to the MQ-20 via advanced autonomy software and a tactical data link. The Avenger drone responded by executing a range of mission tasks, including…",
        "topics": []
      },
      {
        "ref": 32,
        "title": "Frozen tablets and downed drones: Army’s 11th Airborne learns to fight in the Arctic",
        "url": "https://breakingdefense.com/2026/02/frozen-tablets-and-downed-drones-armys-11th-airborne-learns-to-fight-in-the-arctic/",
        "source": "breakingdefense.com",
        "published": "2026-02-23T19:30:21+00:00",
        "summary": "During JPMRC 26-02, the “Arctic Angels” grapple with tough terrain, fragile tech and logistical shortfalls as the Army tries to sharpen its Arctic edge.",
        "topics": []
      },
      {
        "ref": 33,
        "title": "Expanding Joint Integrated Capabilities: 158th Fighter Wing, 104th Fighter Wing, and 103rd Airlift Wing Execute Rapid Rearming and Refueling Exercises",
        "url": "https://www.104fw.ang.af.mil/News/Features/Article/4412187/expanding-joint-integrated-capabilities-158th-fighter-wing-104th-fighter-wing-a/",
        "source": "104fw.ang.af.mil",
        "published": "2026-02-23T19:15:08+00:00",
        "summary": "Westover AIR RESERVE BASE, Chicopee, Mass. – Members from the 104th Fighter Wing, 103rd Airlift Wing, and 158th Fighter Wing recently participated in a series of integrated combat turn (ICT) exercises, June 11-12, 2025, at Westover Air Reserve Base, Chicopee, Mass. The Distributable-ICT exercises consisted of F-15C Eagle’s from the 104th Fighter Wing and F-35A Lightning II’s from the 158th Fighter Wing getting refueled by a C-130H Hercules from the 103rd Airlift Wing that also delivered a full missile loadout for each jet. This exercise proved the capability to refuel and rearm multiple fighte…",
        "topics": []
      },
      {
        "ref": 34,
        "title": "US partially evacuates Beirut embassy amid rising Iran tensions",
        "url": "https://www.bbc.com/news/articles/cj32l00k47lo?at_medium=RSS&at_campaign=rss",
        "source": "bbc.com",
        "published": "2026-02-23T19:08:55+00:00",
        "summary": "The State Department has ordered non-essential staff to leave the embassy in Beirut after a security review.",
        "topics": []
      },
      {
        "ref": 35,
        "title": "Rapid scaling, soldier-led market key to US drone ambitions, Army secretary says",
        "url": "https://www.defensenews.com/news/your-military/2026/02/23/rapid-scaling-soldier-led-market-key-to-us-drone-ambitions-army-secretary-says/",
        "source": "defensenews.com",
        "published": "2026-02-23T19:07:42+00:00",
        "summary": "HUNTSVILLE, Ala. — The conclusion of the Army’s inaugural Best Drone Warfighter Competition saw soldiers awarded in Best Operator, Best Innovation and Best Tactical Squad categories. On hand to present awards to the winners, who were selected from more than 200 competitors during the Feb. 17-19 event, were Army Secretary Dan Driscoll and Maj. Gen. Clair A. Gill, commanding general of the U.S. Army Aviation Center of Excellence. Driscoll, who flew to the Huntsville, Alabama, ceremony after participating in Ukraine-Russia peace talks in Geneva, Switzerland, spoke to Military Times about the sign…",
        "topics": []
      },
      {
        "ref": 36,
        "title": "Space Force seeks market answers on in-orbit refueling",
        "url": "https://spacenews.com/space-force-seeks-market-answers-on-in-orbit-refueling/",
        "source": "spacenews.com",
        "published": "2026-02-23T19:00:00+00:00",
        "summary": "A new RFI poses questions to industry on future refueling architecture The post Space Force seeks market answers on in-orbit refueling appeared first on SpaceNews .",
        "topics": []
      },
      {
        "ref": 37,
        "title": "AST SpaceMobile wins $30 million contract for military  broadband demo",
        "url": "https://spacenews.com/ast-spacemobile-wins-30-million-contract-for-military-broadband-demo/",
        "source": "spacenews.com",
        "published": "2026-02-23T18:08:47+00:00",
        "summary": "The Space Development Agency will explore the use of commercial satellites to test direct-to-device connectivity for future warfighting network The post AST SpaceMobile wins $30 million contract for military broadband demo appeared first on SpaceNews .",
        "topics": []
      },
      {
        "ref": 38,
        "title": "17th Field Artillery Brigade conducts Arctic Ground Raid Mission with HIMARS",
        "url": "https://www.pacom.mil/Media/NEWS/News-Article-View/Article/4412710/17th-field-artillery-brigade-conducts-arctic-ground-raid-mission-with-himars/",
        "source": "pacom.mil",
        "published": "2026-02-23T18:00:00+00:00",
        "summary": "TANANA FLATS TRAINING AREA, Alaska — Soldiers assigned to 17th Field Artillery Brigade conducted a ground raid mission with the High Mobility Artillery Rocket System (HIMARS) during Joint Pacific Multinational Readiness Center 26-02 in support of the 11th Airborne Division.",
        "topics": []
      },
      {
        "ref": 39,
        "title": "U.S. Army to Accelerate Fielding of 1000 km Anti-Ship PrSM",
        "url": "https://www.navalnews.com/naval-news/2026/02/u-s-army-to-accelerate-fielding-of-1000-km-anti-ship-prsm/",
        "source": "navalnews.com",
        "published": "2026-02-23T17:48:27+00:00",
        "summary": "The U.S. Army wants to accelerate the development of a Precision Strike Missile (PrSM) anti-ship variant capable of being fired from the service’s highly mobile rocket launchers and striking maritime targets over a thousand kilometers away, according to a recent notice. PrSM Increment (Inc) 4 is envisioned to equip the ubiquitous High Mobility Rocket Artillery System (HIMARS) and Multiple Rocket Launch Systems with a next-generation long-range strike ability to target moving maritime and ground targets, a mission set that the Army has deemed crucial for expedited early operational capability. …",
        "topics": []
      },
      {
        "ref": 40,
        "title": "Training, logistics and property accountability: Army preparing for influx of small drones",
        "url": "https://breakingdefense.com/2026/02/training-logistics-and-property-accountability-army-preparing-for-influx-of-small-drones/",
        "source": "breakingdefense.com",
        "published": "2026-02-23T17:04:21+00:00",
        "summary": "“If we have a FPV-style drone that is lethal and armed, and we expect that soldier to hit a very precise target at a very precise point … that soldier is going to need a much higher level of skill and training,” said Col. Nick Ryan, the director of Army UAS Transformation with the Aviation Center of Excellence.",
        "topics": []
      },
      {
        "ref": 41,
        "title": "Space Systems Command Funds Five Fight Tonight Solutions to Pressing USSF Challenges",
        "url": "https://www.ssc.spaceforce.mil/Newsroom/Article/4411899/space-systems-command-funds-five-fight-tonight-solutions-to-pressing-ussf-chall",
        "source": "ssc.spaceforce.mil",
        "published": "2026-02-23T16:48:00+00:00",
        "summary": "A containerized backup gateway/GEP (ground entry point) and four other technological solutions to pressing U.S. Space Force challenges were announced as the winners of Space Systems Command’s (SSC) “Fight Tonight” competition Feb. 12, 2026. The competition, now in its fourth consecutive year, encourages military and civilian employees to identify technologies that build upon U.S. Space Force (USSF) capabilities or introduce new ones. “SSC’s annual workforce innovation competition clearly showcases the level of talent our team brings to the table not just once a year, but every single day,” sai…",
        "topics": []
      },
      {
        "ref": 42,
        "title": "NASA Working Group Targets Autonomous Multi-Aircraft UAS Operations",
        "url": "https://dronelife.com/2026/02/23/nasa-working-group-targets-autonomous-multi-aircraft-uas-operations/",
        "source": "dronelife.com",
        "published": "2026-02-23T16:38:32+00:00",
        "summary": "A NASA-sponsored working group is pushing forward efforts to make autonomous, multi-drone fleet operations a routine part of the national airspace, and it’s looking for new members to help. The Routine Autonomous Multi-Aircraft Operations (RAM-AO) Working Group, formerly the m:N Working Group, meets March 3–5 at NASA Ames Research Center in Mountain View, California. Aptima, […] The post NASA Working Group Targets Autonomous Multi-Aircraft UAS Operations appeared first on DRONELIFE .",
        "topics": []
      },
      {
        "ref": 43,
        "title": "DHS Offers Counter-UAV Siting Advice For World Cup Communities",
        "url": "https://dronelife.com/2026/02/23/dhs-offers-counter-uav-siting-advice-for-world-cup-communities/",
        "source": "dronelife.com",
        "published": "2026-02-23T16:28:45+00:00",
        "summary": "By Dronelife Features Editor Jim Magill (Editor’s note: This following story is part of an ongoing series of stories on efforts to establish new counter-UAS protocols in the U.S. to protect high-profile sporting events and critical infrastructure from the potential threats posed by drones flown by careless or hostile actors.) As U.S. cities get ready […] The post DHS Offers Counter-UAV Siting Advice For World Cup Communities appeared first on DRONELIFE .",
        "topics": []
      },
      {
        "ref": 44,
        "title": "Rapid Mapping for a 24/7 Defense Environment: SimActive on Speed, Security, and Scalable Intelligence",
        "url": "https://dronelife.com/2026/02/23/rapid-mapping-for-a-24-7-defense-environment-simactive-on-speed-security-and-scalable-intelligence/",
        "source": "dronelife.com",
        "published": "2026-02-23T16:02:50+00:00",
        "summary": "As defense budgets rise and geopolitical tensions reshape operational priorities, militaries are investing heavily in technologies that can turn raw data into timely, actionable intelligence. For photogrammetry company SimActive, that mission has been central since its founding. In a recent interview with DRONELIFE, CEO Dr. Philippe Simard discussed how the company’s flagship software, Correlator3D, continues […] The post Rapid Mapping for a 24/7 Defense Environment: SimActive on Speed, Security, and Scalable Intelligence appeared first on DRONELIFE .",
        "topics": []
      },
      {
        "ref": 45,
        "title": "Topping Out Ceremony Marks Investment in Future of Submarine Readiness",
        "url": "https://cnrse.cnic.navy.mil/Installations/NCBC-Gulfport/News/Article/4411777/topping-out-ceremony-marks-investment-in-future-of-submarine-readiness/",
        "source": "cnrse.cnic.navy.mil",
        "published": "2026-02-23T15:51:00+00:00",
        "summary": "A topping out ceremony was held Jan. 29 to mark a major milestone in the construction of a new facility for the Nuclear Regional Maintenance Department (NRMD) at Naval Submarine Base (NSB) Kings Bay, Georgia.",
        "topics": []
      },
      {
        "ref": 46,
        "title": "What RTX (RTX)'s New Defense and Autonomy Wins Mean for Shareholders",
        "url": "https://finance.yahoo.com/news/rtx-rtx-defense-autonomy-wins-140932070.html?.tsrc=rss",
        "source": "finance.yahoo.com",
        "published": "2026-02-23T14:09:32+00:00",
        "summary": "In recent weeks, RTX businesses secured U.S. defense milestones, including Navy approval of Raytheon’s StormBreaker smart weapon for F/A-18E/F Super Hornets and successful Collins Aerospace flight tests of autonomous mission software for the Air Force’s Collaborative Combat Aircraft program. Together with new work on thin-film lithium niobate wafers for secure photonics, these advances highlight RTX’s deepening role in high-end weapons, autonomy, and next‑generation communications for both...",
        "topics": []
      },
      {
        "ref": 47,
        "title": "GA-ASI and USAF Demonstrate Manned-Unmanned Teaming With F-22 and MQ-20 In Joint Autonomy Exercise",
        "url": "https://www.suasnews.com/2026/02/ga-asi-and-usaf-demonstrate-manned-unmanned-teaming-with-f-22-and-mq-20-in-joint-autonomy-exercise/",
        "source": "suasnews.com",
        "published": "2026-02-23T13:17:17+00:00",
        "summary": "In collaboration with the U.S. Air Force, General Atomics Aeronautical Systems, Inc. (GA-ASI) conducted its latest",
        "topics": []
      },
      {
        "ref": 48,
        "title": "GA-ASI Announces YFQ-42A Dark Merlin",
        "url": "https://www.suasnews.com/2026/02/ga-asi-announces-yfq-42a-dark-merlin/",
        "source": "suasnews.com",
        "published": "2026-02-23T13:01:06+00:00",
        "summary": "General Atomics Aeronautical Systems, Inc. (GA-ASI) is giving its U.S. Air Force Collaborative Combat Aircraft",
        "topics": []
      }
    ]
  }
}